Tekla Open API Reference for Tekla Structures 2025
Vector.Dot Method (Vector)
 Returns a dot product of the current vector and the given vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Dot(
	Vector Vector
)
Public Function Dot (
	Vector As Vector
) As Double
Parameters
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be used.
Return Value
Type: Double
The dot product of the vectors.
See Also
Reference
Vector Class
Dot Overload
Tekla.Structures.Geometry3d Namespace